cats99/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)
        if @cat.save
---
INSERT INTO "cats" ("color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["color", "orange"], ["name", "Tom"], ["sex", "M"], ["description", "Tom & Jerry"], ["created_at", "2019-04-30 19:07:52.955333"], ["updated_at", "2019-04-30 19:07:52.955333"]]

    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "color" = $2, "sex" = $3, "description" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["name", "test"], ["color", "indigo"], ["sex", "F"], ["description", "uh oh"], ["updated_at", "2019-04-30 19:18:14.946698"], ["id", 2]]